# TransferringProjectStandardsEventArgs Properties

---
The TransferringProjectStandardsEventArgs type exposes the following members.
| Name| Description
---|---|---
| Cancellable|  Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs)
| Document|  The document associated with the event. (Inherited from RevitAPIPreDocEventArgs)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs)
| SourceDocument|  Source document.
| TargetDocument|  Target document.
Top
#### Reference
TransferringProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace